#### Melt and Pivot

In [1]:
import pandas as pd
import numpy as np

In [2]:
animals = pd.DataFrame(
        {
            "species": ["Lion", "Giraffe", "Elephant"],
            "Africa": [5, 12, 8],
            "Asia": [0, 1, 2]
        }
)

In [3]:
animals

    species  Africa  Asia
0      Lion       5     0
1   Giraffe      12     1
2  Elephant       8     2

In [8]:
melted_animals  = animals.melt(
    id_vars    = 'species',
    value_vars = ('Africa', 'Asia'),
    var_name   = 'continent',
    value_name = 'population'   
)
melted_animals

    species continent  population
0      Lion    Africa           5
1   Giraffe    Africa          12
2  Elephant    Africa           8
3      Lion      Asia           0
4   Giraffe      Asia           1
5  Elephant      Asia           2